w6d5/my_99_cats/app/views/cats/index.html.erb

<ul>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"