w7d2/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @band = Band.find(params[:id])