w7d2/music_app/app/controllers/bands_controller.rb

  def show
    @band = Band.find_by(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE (1) LIMIT $1  [["LIMIT", 1]]